Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties Class
 The AnalysisModelJobProperties class contains information related to analysis model job properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelJobProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelJobProperties
Public NotInheritable Class AnalysisModelJobProperties
The AnalysisModelJobProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelJobProperties
Initializes a new instance of the AnalysisModelJobProperties class
Top
Properties
Name | Description
ApprovedDate
 The date of the approval.
ApprovedName
 The name of approver.
CheckerDate
 The date of the checking.
CheckerName
 The name of the checker.
ClientName
 The name of the client.
EngineerDate
 The date of the engineering.
EngineerName
 The name of the engineer.
JobComment
 The comment of the job.
JobName
 The name of the job.
JobNumber
 The number of the job.
PartNumber
 The number of the part.
ReferenceNumber
 The reference number.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace